касса_Вегас/src/Enums/СтатусыЗаказовКлиентов/СтатусыЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказовКлиентов</name>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

касса_Вегас/src/Enums/СтатусыЗаказовКлиентов/ManagerModule.bsl
Функция ПолучитьСтатусЗаказаПоНаименованию(НаименованиеСтатуса) Экспорт
	
	Если НаименованиеСтатуса = "НеСогласован" Тогда
		
		Возврат Перечисления.СтатусыЗаказовКлиентов.НеСогласован;
		
	ИначеЕсли НаименованиеСтатуса = "Согласован" Тогда
		
		Возврат Перечисления.СтатусыЗаказовКлиентов.Согласован;
		
	ИначеЕсли НаименованиеСтатуса = "Выполнен" Тогда
		
		Возврат Перечисления.СтатусыЗаказовКлиентов.Выполнен;
		
	ИначеЕсли НаименованиеСтатуса = "Отменен" Тогда
		
		Возврат Перечисления.СтатусыЗаказовКлиентов.Отменен;
		
	КонецЕсли;
	
КонецФункции
